# Analyse des données textuelles

In [1]:
import os
import re
import pandas as pd

#### Importer la base de données

In [2]:
df = pd.read_csv('DF_JOB.csv', sep=';', encoding='cp1252')

In [3]:
df.head(3)

,Unnamed: 0,TITRE,DESCRIPTION,ENTREPRISE,LIEUX
0,1,rpa & data : automatisation des flux de donnée...,description de l'entreprise almond recherche d...,almond,"sèvres, hauts-de-seine"
1,2,data scientist f/h,"l'entreprise leader de son marché, le groupe p...",réseau primever,"agen, lot-et-garonne"
2,3,data engineer sénior (f/h),description de l'entreprise asendit est spécia...,asendit,lyon

####  Nettoyage et préparation de la base de données

In [4]:
del df['Unnamed: 0']

In [5]:
df.head(3)

,TITRE,DESCRIPTION,ENTREPRISE,LIEUX
0,rpa & data : automatisation des flux de donnée...,description de l'entreprise almond recherche d...,almond,"sèvres, hauts-de-seine"
1,data scientist f/h,"l'entreprise leader de son marché, le groupe p...",réseau primever,"agen, lot-et-garonne"
2,data engineer sénior (f/h),description de l'entreprise asendit est spécia...,asendit,lyon

In [6]:
df.shape

(2000, 4)

In [7]:
def func(a):
    if "analyst" in a.lower():
        return "data analyst"
    elif "scientist" in a.lower():
        return "data scientist"
    elif "engineer" in a.lower():
        return "data engineer"
    elif "data science" in a.lower():
        return "data scientist"
    elif "bi " in a.lower():
        return "bi"
    elif "business intelligence" in a.lower():
        return "bi"
    elif "officer" in a.lower():
        return "data officer"
    elif "architect" in a.lower():
        return "data architect"
    elif "big data" in a.lower():
        return "ingénieur big data"
    elif "consultant" in a.lower():
        return "consultant data"
    elif "manager" in a.lower():
        return "data manager"
    elif "steward" in a.lower():
        return "data steward"
    else:
        return "Other"

df["POSTE"] = df.TITRE.apply(lambda x: func(x))

In [8]:
df.head(5)

,TITRE,DESCRIPTION,ENTREPRISE,LIEUX,POSTE
0,rpa & data : automatisation des flux de donnée...,description de l'entreprise almond recherche d...,almond,"sèvres, hauts-de-seine",Other
1,data scientist f/h,"l'entreprise leader de son marché, le groupe p...",réseau primever,"agen, lot-et-garonne",data scientist
2,data engineer sénior (f/h),description de l'entreprise asendit est spécia...,asendit,lyon,data engineer
3,data analyst f/h,description de l'entreprise aventure entrepren...,voyage privé,aix-en-provence,data analyst
4,data scientist f/h,"leader de son marché, le groupe primever dével...",réseau primever,"agen, lot-et-garonne",data scientist

#### Les métiers data recherchés

In [9]:
df['POSTE'].value_counts()

Other                 557
data analyst          425
data engineer         301
data scientist        248
consultant data       132
data manager          117
data architect         73
ingénieur big data     69
bi                     55
data officer           15
data steward            8
Name: POSTE, dtype: int64

#### Préparation des données textuelles de la colonne 'DESCRIPTION'

In [10]:
list_analyst = df.loc[df['POSTE'] == 'data analyst', 'DESCRIPTION'].values
list_scientist = df.loc[df['POSTE'] == 'data scientist', 'DESCRIPTION']. values
list_engineer = df.loc[df['POSTE'] == 'data engineer', 'DESCRIPTION']. values

In [11]:
type(list_analyst)

numpy.ndarray

In [12]:
len(list_analyst)

425

In [13]:
list_analyst = " ".join(list_analyst)
list_scientist = " ".join(list_scientist)
list_engineer = " ".join(list_engineer)

##### Nettoyage du texte des caractères spéciaux

In [14]:
list_analyst = re.sub(r"[.´`:' ;,?=0123456789+@*–<>%»«^,)(#!/\-•]+"," ",list_analyst) 
list_scientist = re.sub(r"[.´`:' ;,?=0123456789+@*–<>%»«^,)(#!/\-•]+"," ",list_scientist) 
list_engineer = re.sub(r"[.´`:' ;,?=0123456789+@*–<>%»«^,)(#!/\-•]+"," ",list_engineer)

In [15]:
Poste = ['Data analyst', 'Data scientist', 'Data engineer']

In [16]:
description = [list_analyst, list_scientist, list_engineer]

In [17]:
nt = len(Poste)  
d = ' '.join(description)
e = d.split()

#### création du dictionnaire "motot" pour associer chaque mot à son effectif

In [18]:
motot={}

In [19]:
for mot in e:
	motot[mot] = 0  
for  mot in e:
	motot[mot] += 1

###### Les 10 premieres lignes de motot

In [24]:
list(motot.items())[0:10][0:10]

[('description', 480),
 ('de', 32398),
 ('l', 6562),
 ('entreprise', 902),
 ('aventure', 149),
 ('entrepreneuriale', 11),
 ('lancée', 17),
 ('en', 9299),
 ('france', 711),
 ('voyage', 42)]

In [21]:
print("la longueur du dictionnaire est :",len(motot), "mots")

la longueur du dictionnaire est : 16875 mots

##### Associer chaque mot à son effectif dans les troix objets : "list_analyst, list_sientist, list_engineer" stocker dans l'objet "description"

In [22]:
motex = {}

In [23]:
for mot in motot:
    motex[mot] = [0]*nt

###### Les 10 premieres lignes de motex

In [25]:
list(motex.items())[0:10][0:10]

[('description', [0, 0, 0]),
 ('de', [0, 0, 0]),
 ('l', [0, 0, 0]),
 ('entreprise', [0, 0, 0]),
 ('aventure', [0, 0, 0]),
 ('entrepreneuriale', [0, 0, 0]),
 ('lancée', [0, 0, 0]),
 ('en', [0, 0, 0]),
 ('france', [0, 0, 0]),
 ('voyage', [0, 0, 0])]

In [26]:
for i in range(nt):   
    for mot in description[i].split():
        motex[mot][i] += 1

###### Les 10 premieres lignes de motex

In [27]:
list(motex.items())[0:10][0:10]

[('description', [160, 114, 206]),
 ('de', [13556, 8280, 10562]),
 ('l', [2699, 1656, 2207]),
 ('entreprise', [394, 208, 300]),
 ('aventure', [69, 28, 52]),
 ('entrepreneuriale', [5, 3, 3]),
 ('lancée', [11, 1, 5]),
 ('en', [3945, 2372, 2982]),
 ('france', [369, 148, 194]),
 ('voyage', [12, 6, 24])]

#### Transformer le dictionnaire en dataframe

In [29]:
texto = pd.DataFrame.from_dict(motex, orient='index')
texto.head(3)

                 0     1      2
description    160   114    206
de           13556  8280  10562
l             2699  1656   2207

In [30]:
texto.reset_index(inplace=True)
texto.head(3)

         index      0     1      2
0  description    160   114    206
1           de  13556  8280  10562
2            l   2699  1656   2207

In [31]:
(texto.columns)

Index(['index', 0, 1, 2], dtype='object')

In [32]:
texto.rename(columns = {'index':'mot',
                        0:'Data analyst', 
                        1:'Data scientist',
                        2:'Data engineer'}, inplace = True)

In [33]:
texto.head(3)

           mot  Data analyst  Data scientist  Data engineer
0  description           160             114            206
1           de         13556            8280          10562
2            l          2699            1656           2207

#### Création d'une liste des outils informatiques des métiers data

In [34]:
word = ['sql', 'bi', 'python', 'sas', 'etl', 'oracle', 'machinelearning', 'rstudio', 'api', 'power', 
        'talend', 'mysql', 'r', 'java', 'js', 'javascrispt', 'mongodb', 'cloud', 'datawarehouse',
       'datamarts', 'dataviz', 'qlik', 'nosql', 'Datavisualisation', 'query', 'datalake', 'bigquery',
       'postgresql', 'warehousing', 'reporting', 'css', 'html', 'kpi', 'api', 'reactjs', 'nlp', 'pandas',
       'scikit', 'tensorflow', 'numpy', 'matplotlib', 'seaborn', 'scala', 'docker', 'github', 'apache',
       'spark', 'tableau', 'dataiku', 'mining', 'datamining', 'Storytelling', 'crm', 'aws', 'azure', 'informatica',
       'spreadsheet', 'classification', 'clustering', 'rgpd', 'dashboards', 'jupyter', 'nltk', 'ggplot', 'microsoft',
       'matlab', 'scipy', 'hadoop', 'php', 'linux']

In [35]:
len(word)

70

#### Garder uniquement les lignes contenant les mots dans la liste "word"

In [36]:
fss = texto[texto.mot.isin(word) == True]

In [37]:
fss.head(10)

          mot  Data analyst  Data scientist  Data engineer
127       crm            77              36             23
263   tableau           135              21             42
264   dataiku            31              26              9
266  bigquery            15               9             33
268       etl            41               9            113
270    apache             1               2             16
271     spark            13              53            161
275     cloud            71             102            418
280    python           203             271            267
281     scala             6              19            100

In [38]:
fss.shape

(66, 4)

#### Exportation de la base de données en format excel

In [39]:
fss.to_excel(r'final result.xlsx')

##### Tri décroissant en fonction de compétences techniques les plus recherchées pour le poste Data Analyst

In [40]:
fss.sort_values(by='Data analyst', ascending=False).head(6)

            mot  Data analyst  Data scientist  Data engineer
311         sql           284             111            214
314          bi           255              25            134
280      python           203             271            267
688   reporting           136              10             38
263     tableau           135              21             42
1887      power           128              14             51

##### Tri décroissant en fonction de compétences techniques les plus recherchées pour le poste Data Scientist

In [41]:
fss.sort_values(by='Data scientist', ascending=False).head(6)

          mot  Data analyst  Data scientist  Data engineer
280    python           203             271            267
311       sql           284             111            214
275     cloud            71             102            418
333         r            67             102             17
11812     nlp             0              59              7
1919    azure            39              59            237

##### Tri décroissant en fonction de compétences techniques les plus recherchées pour le poste Data Engineer

In [42]:
fss.sort_values(by='Data engineer', ascending=False).head(6)

         mot  Data analyst  Data scientist  Data engineer
275    cloud            71             102            418
280   python           203             271            267
1919   azure            39              59            237
311      sql           284             111            214
271    spark            13              53            161
314       bi           255              25            134